# 3 Создать текстовый файл (не программно), построчно записать
# фамилии сотрудников и величину их окладов.
# Определить, кто из сотрудников имеет оклад менее 20 тыс.,
# вывести фамилии этих сотрудников. Выполнить подсчет средней
# величины дохода сотрудников.

sum = 0
with open("File3", encoding="utf-8") as file:
    lines = file.readlines()
    for line in lines:
        surname, salary = line.split()
        sum += int(salary)
        if int(salary) < 20000:
            print("Имеет оклад менее 20 тыс.: ", surname)

print("Средняя величина дохода сотрудников:", sum/len(lines))